#+TITLE: Bug Report
#+DATE: <2015-12-03 Thu>
#+AUTHOR: Brian Beckman
#+OPTIONS: ':t *:t -:t ::t <:t H:3 \n:nil ^:t arch:headline
#+OPTIONS: author:t c:nil creator:comment d:(not LOGBOOK) date:t e:t
#+OPTIONS: email:nil f:t inline:t num:t p:nil pri:nil stat:t tags:t
#+OPTIONS: tasks:t tex:t timestamp:t toc:t todo:t |:t
#+EXCLUDE_TAGS: noexport
#+LANGUAGE: en
#+SELECT_TAGS: export
#+LaTeX_CLASS_OPTIONS: [10pt,oneside,x11names]
#+LaTeX_HEADER: \usepackage{geometry}
#+LaTeX_HEADER: \usepackage{palatino}
#+LaTeX_HEADER: \usepackage{siunitx}
#+LaTeX_HEADER: \usepackage{braket}
#+LaTeX_HEADER: \usepackage[euler-digits,euler-hat-accent]{eulervm}
#+OPTIONS: toc:2

* Version information
  #+BEGIN_SRC emacs-lisp :results output :exports results :tangle no
    (princ (concat (format "Emacs version: %s\n" (emacs-version))
                   (format "org version: %s\n" (org-version))))
    (setq org-confirm-babel-evaluate nil)
    (org-babel-map-src-blocks nil (org-babel-remove-result))
  #+END_SRC

  #+RESULTS:
  : Emacs version: GNU Emacs 26.2 (build 2, x86_64-pc-linux-gnu, GTK+ Version 3.24.4)
  :  of 2019-04-12
  : org version: 9.2.2

#+BEGIN_SRC lisp :exports results
    (lisp-implementation-version)
#+END_SRC

* Prints Bignums as Floating Point!

#+BEGIN_SRC lisp :exports both :tangle no :results values
  (defun fact (n)
    (if (= 0 n)
        1
        (* n (fact (- n 1)))))
  (fact 60)
#+END_SRC

#+RESULTS:
: 8.32098711274139e+81

#+BEGIN_SRC lisp :exports both :tangle no :results values
  (defun range (max &key (min 0) (step 1))
    (loop for n from min below max by step
          collect n))

  (reduce #'* (range 61 :min 1))
#+END_SRC

#+RESULTS:
: 8.32098711274139e+81
